<!DOCTYPE html>
<html>
<head>
<style>
body {
    font-family: sans-serif;
}
</style>
</head>
<body>

<h1>Datenschutzrichtlinie</h1>

<p><strong>Wirksamkeitsdatum: 14. Oktober 2024</strong></p>

<h2>Einf&uuml;hrung</h2>

<p>Diese Datenschutzrichtlinie beschreibt, wie "Solar Lens" Ihre personenbezogenen Daten sammelt, verwendet und sch&uuml;tzt. Wir verpflichten uns zum Schutz Ihrer Privatsph&auml;re und zur Gew&auml;hrleistung der sicheren Behandlung Ihrer personenbezogenen Daten.</p>

<h2>Informationen, die wir sammeln</h2>

<ul>
<li><strong>Anmeldeinformationen:</strong> Wir speichern Ihre Anmeldeinformationen lokal auf Ihrem Ger&auml;t mithilfe des Apple-Schl&uuml;sselbunds. Diese Informationen werden nicht an Dritte &uuml;bertragen.</li>
</ul>

<h2>Wie wir Ihre Informationen verwenden</h2>

<ul>
<li><strong>Anmeldeauthentifizierung:</strong> Wir verwenden Ihre gespeicherten Anmeldeinformationen, um Sie bei der Anmeldung in der App zu authentifizieren.</li>
</ul>

<h2>Datenaustausch</h2>

<ul>
<li>Wir geben Ihre personenbezogenen Daten nicht an Dritte weiter, es sei denn, dies ist gesetzlich vorgeschrieben oder zur Erbringung wesentlicher Dienstleistungen erforderlich.</li>
<li>Die App verwendet die Solar Manager API, die von Solar Manager AG betrieben wird. Wir k&ouml;nnen Ihre Anmeldeinformationen mit Solar Manager AG teilen, um auf deren Dienste zuzugreifen, aber wir teilen keine anderen personenbezogenen Daten mit ihnen.</li>
</ul>

<h2>Datensicherheit</h2>

<ul>
<li>Wir setzen robuste Sicherheitsmassnahmen ein, um Ihre personenbezogenen Daten vor unbefugtem Zugriff, Offenlegung, &Auml;nderung oder Zerst&ouml;rung zu sch&uuml;tzen.</li>

<li>Ihre Anmeldeinformationen werden sicher im Apple-Schl&uuml;sselbund gespeichert, der fortschrittliche Verschl&uuml;sselungstechniken zum Schutz sensibler Daten verwendet.</li>
</ul>

<h2>Ihre Rechte</h2>

<p>Sie haben das Recht:

<ul>
<li>Auf Ihre personenbezogenen Daten in Ihrem Apple-Schl&uuml;sselbund zuzugreifen und diese zu korrigieren.</li>
<li>Ihre personenbezogenen Daten in Ihrem Apple-Schl&uuml;sselbund zu l&ouml;schen.</li>
<li>Der Verarbeitung Ihrer personenbezogenen Daten zu widersprechen.</li>
</ul>

<h2>&Auml;nderungen dieser Datenschutzrichtlinie</h2>

<p>Wir k&ouml;nnen diese Datenschutzrichtlinie von Zeit zu Zeit aktualisieren. Wir werden Sie &uuml;ber alle wesentlichen &Auml;nderungen informieren, indem wir eine &uuml;berarbeitete Version auf unserer Website oder in der App ver&ouml;ffentlichen. </p>

<h2>Kontaktieren Sie uns</h2>

<p>Wenn Sie Fragen zu dieser Datenschutzrichtlinie oder unseren Datenpraktiken haben, kontaktieren Sie uns bitte unter marc@idev.ch.</p>

</body>
</html>